IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod
Flags controlling the method of the check by a interaction diagram

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDCheckTypeNuMuMu
known Ned,Med; calculate Nrd,Mrd as intersection of ID and line=[0,0];[Ned,Med]

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDCheckTypeNuMM
know Med; calculate +-Nrd

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDCheckTypeNMuMu
know Ned; calculate +-Mrd

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDOnlyUlsForce1
Find intersection only in the direction of the Fd

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDOnlyPlanarCheck
Only planar check is required

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDPlaneInfoRequest
Information about plane of deformation is required

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDPlanar_0deg
used by CheckForceQuick

IdeaRS.OpenModel.Concrete.CheckResult.IntDiagCheckMethod.IDPlanar_90deg
used by CheckForceQuick